logs/fio/blk/4M-2/4K2_s1_q4_4_v1_blk.log
randw-4K-n1-c1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
randw-4K-n2-c2: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
randw-4K-n4-c4: (g=2): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
randw-4K-n8-c8: (g=3): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
randw-4K-n12-c12: (g=4): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.1
Starting 27 processes

randw-4K-n1-c1: (groupid=0, jobs=1): err= 0: pid=1172: Wed Jul 24 14:46:21 2019
  write: IOPS=51.4k, BW=201MiB/s (210MB/s)(6019MiB/30001msec)
    slat (usec): min=2, max=720, avg= 3.36, stdev= 2.60
    clat (usec): min=242, max=1431, avg=616.90, stdev=43.74
     lat (usec): min=248, max=1435, avg=620.92, stdev=43.64
    clat percentiles (usec):
     | 10.000th=[  594], 20.000th=[  603], 30.000th=[  603], 40.000th=[  611],
     | 50.000th=[  619], 70.000th=[  635], 90.000th=[  652], 99.000th=[  685],
     | 99.900th=[ 1074], 99.990th=[ 1319], 99.999th=[ 1385]
   bw (  KiB/s): min=161403, max=204038, per=79.76%, avg=163857.07, stdev=7147.24, samples=59
   iops        : min=40350, max=51009, avg=40963.92, stdev=1786.82, samples=59
  lat (usec)   : 250=0.01%, 500=1.53%, 750=98.34%, 1000=0.01%
  lat (msec)   : 2=0.12%
  cpu          : usr=21.27%, sys=33.96%, ctx=1356064, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1540858,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n2-c2: (groupid=1, jobs=2): err= 0: pid=1176: Wed Jul 24 14:46:21 2019
  write: IOPS=51.3k, BW=201MiB/s (210MB/s)(6018MiB/30002msec)
    slat (usec): min=2, max=684, avg= 3.61, stdev= 2.64
    clat (usec): min=351, max=5636, avg=1239.82, stdev=76.07
     lat (usec): min=367, max=5642, avg=1244.11, stdev=75.95
    clat percentiles (usec):
     | 10.000th=[ 1205], 20.000th=[ 1221], 30.000th=[ 1237], 40.000th=[ 1237],
     | 50.000th=[ 1254], 70.000th=[ 1270], 90.000th=[ 1287], 99.000th=[ 1336],
     | 99.900th=[ 1680], 99.990th=[ 2180], 99.999th=[ 5604]
   bw (  KiB/s): min=80463, max=102368, per=39.99%, avg=82124.10, stdev=3624.78, samples=118
   iops        : min=20115, max=25592, avg=20530.69, stdev=906.21, samples=118
  lat (usec)   : 500=0.01%, 750=0.55%, 1000=1.03%
  lat (msec)   : 2=98.39%, 4=0.02%, 10=0.01%
  cpu          : usr=11.12%, sys=17.96%, ctx=1347508, majf=0, minf=17
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1540502,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n4-c4: (groupid=2, jobs=4): err= 0: pid=1181: Wed Jul 24 14:46:21 2019
  write: IOPS=51.5k, BW=201MiB/s (211MB/s)(6039MiB/30003msec)
    slat (usec): min=2, max=1037, avg= 4.27, stdev= 3.94
    clat (usec): min=211, max=16307, avg=2476.19, stdev=169.69
     lat (usec): min=219, max=16310, avg=2481.22, stdev=169.51
    clat percentiles (usec):
     | 10.000th=[ 2442], 20.000th=[ 2474], 30.000th=[ 2474], 40.000th=[ 2474],
     | 50.000th=[ 2507], 70.000th=[ 2507], 90.000th=[ 2540], 99.000th=[ 2606],
     | 99.900th=[ 3064], 99.990th=[ 4883], 99.999th=[16188]
   bw (  KiB/s): min=48060, max=64108, per=23.94%, avg=49334.85, stdev=2103.98, samples=236
   iops        : min=12015, max=16027, avg=12333.36, stdev=525.99, samples=236
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2=1.94%, 4=98.01%, 10=0.01%, 20=0.01%
  cpu          : usr=6.27%, sys=9.83%, ctx=1332839, majf=0, minf=40
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1546039,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n8-c8: (groupid=3, jobs=8): err= 0: pid=1188: Wed Jul 24 14:46:21 2019
  write: IOPS=51.5k, BW=201MiB/s (211MB/s)(6036MiB/30005msec)
    slat (usec): min=2, max=6803, avg=92.65, stdev=316.85
    clat (usec): min=260, max=17627, avg=4871.85, stdev=1502.23
     lat (usec): min=271, max=18472, avg=4965.88, stdev=1550.20
    clat percentiles (usec):
     | 10.000th=[ 3294], 20.000th=[ 3720], 30.000th=[ 3818], 40.000th=[ 4293],
     | 50.000th=[ 4424], 70.000th=[ 5145], 90.000th=[ 7046], 99.000th=[ 9634],
     | 99.900th=[11994], 99.990th=[14091], 99.999th=[16581]
   bw (  KiB/s): min=15738, max=40964, per=9.37%, avg=19293.61, stdev=3288.17, samples=472
   iops        : min= 3934, max=10241, avg=4823.04, stdev=822.06, samples=472
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=33.65%, 10=65.57%, 20=0.77%
  cpu          : usr=5.08%, sys=6.92%, ctx=442301, majf=0, minf=81
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1545254,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n12-c12: (groupid=4, jobs=12): err= 0: pid=1199: Wed Jul 24 14:46:21 2019
  write: IOPS=53.5k, BW=209MiB/s (219MB/s)(6266MiB/30003msec)
    slat (usec): min=3, max=7704, avg=32.62, stdev=213.71
    clat (usec): min=9, max=24049, avg=7141.06, stdev=1366.76
     lat (usec): min=21, max=24065, avg=7175.43, stdev=1395.06
    clat percentiles (usec):
     | 10.000th=[ 6259], 20.000th=[ 6849], 30.000th=[ 6980], 40.000th=[ 7373],
     | 50.000th=[ 7439], 70.000th=[ 7504], 90.000th=[ 7635], 99.000th=[11600],
     | 99.900th=[14746], 99.990th=[18220], 99.999th=[21627]
   bw (  KiB/s): min=14912, max=42666, per=8.36%, avg=17880.63, stdev=3875.81, samples=720
   iops        : min= 3728, max=10666, avg=4469.87, stdev=968.96, samples=720
  lat (usec)   : 10=0.01%, 50=0.01%, 100=0.01%, 250=0.01%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=7.31%, 10=90.28%, 20=2.39%, 50=0.01%
  cpu          : usr=4.91%, sys=6.35%, ctx=522266, majf=0, minf=118
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1604125,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=201MiB/s (210MB/s), 201MiB/s-201MiB/s (210MB/s-210MB/s), io=6019MiB (6311MB), run=30001-30001msec

Run status group 1 (all jobs):
  WRITE: bw=201MiB/s (210MB/s), 201MiB/s-201MiB/s (210MB/s-210MB/s), io=6018MiB (6310MB), run=30002-30002msec

Run status group 2 (all jobs):
  WRITE: bw=201MiB/s (211MB/s), 201MiB/s-201MiB/s (211MB/s-211MB/s), io=6039MiB (6333MB), run=30003-30003msec

Run status group 3 (all jobs):
  WRITE: bw=201MiB/s (211MB/s), 201MiB/s-201MiB/s (211MB/s-211MB/s), io=6036MiB (6329MB), run=30005-30005msec

Run status group 4 (all jobs):
  WRITE: bw=209MiB/s (219MB/s), 209MiB/s-209MiB/s (219MB/s-219MB/s), io=6266MiB (6570MB), run=30003-30003msec

Disk stats (read/write):
  vda: ios=327/7753258, merge=0/0, ticks=56/23439964, in_queue=23435256, util=99.22%